var json = {
    /**
     * 获取获取余额记录
     */
	"/views/user/cash/log": {
        "get:load":{
			"params": {
                //刷选使用的类型 "充值"  "消费"
                "type":"消费",
                //筛选的时间月份
                "month":"2019-08",
                //搜索关键字
                "keywords":"充值",
            },
            "date":{
                //筛选时间列表
                "date_list": [
                    "2019-09",
                    "2019-08"
                ],
                //筛选类型列表
                "type_list": [
                    "充值",
                    "消费"
                ],
                //返回列表的数据
                "list": [
                    {
                        "id": 10,
                        "created": 1564192699,
                        //用户id
                        "user_id": 1,
                        //变更金额
                        "count": 10,
                        //当前的年月
                        "month": "2019-08",
                        //介绍
                        "des": "充值10元"
                    },
                ]
        
            },
        }
    },

}